{
  "main": {
    "name": "JM",
    "occupation": "Father, Husband, Entrepreneur",
    "description": "Let's Work",
    "image": "profilepic.jpg",
    "bio": "I am an entrepreneur with a passion for high-quality menswear, menswear education, and JavaScript Development. In the last ten years, I have dedicated myself to small business and local economic development. I work closely with other entrepreneurs, c-level executives, and senior leadership to create unique projects that bring brand awareness and generate revenue. Apart from being a full-time entrepreneur, I'm a husband and father living and working in San Antonio, Texas. I love music, menswear, business development, coffee, and a good cigar. When forced indoors, I follow whatever television shows my wife is watching, I am an aspiring product designer, and I spend my free time exploring the latest technology advancements in the web + mobile development world. Lastly, I am optimistic and enjoy problem-solving at any level. I take pride in helping people find connections that add value to their aspirations, business, and lifestyle.",
    "contactmessage": "Lets work.",
    "email": "narvaez.jonmichael@gmail.com",
    "phone": "+1 2104544340",
    "address": {
      "street": "110 E. Houston St",
      "city": "San Antonio",
      "state": "Texas",
      "zip": "78205"
    },
    "website": "https://www.jonmichaelnarvaez.com",
    
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/jonmichaelnarvaez",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/jmcancode",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/jm_cancode/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/jmcancode",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "My professional skill stack",
    "education": [
      {
        "school": "University of Texas at San Antonio",
        "degree": "Bachelor's Degree, Social Science",
        "graduated": "2009 -2011",
        "description": ""
      }
    ],
    "work": [
      {
        "company": "J12 Designs",
        "title": "Senior Developer",
        "years": "2021 - Present",
        "description": "As a Senior Developer, I work closely with the Design team to bring unique and creative programable solutions for businesses, high profile individuals, professional athletes, and more. I write clean and scalable code using JavaScript-based frameworks that work across all platforms and operating systems. We create unforgettable experiences for our clients and take pride in quality data-driven software that brings your brand to new heights."
      },
      {
        "company": "B-Boy Creative",
        "title": "Freelance Developer",
        "years": "2019 - Present",
        "description": "As a freelance web and mobile developer, I work closely with small to large-sized advertising and marketing firms to bring client mock-ups to life. From conception to deployment, I cover the full lifecycle of an application to create a clean, functional, and scalable application. When I began learning to program, I realized that I have a competitive advantage in an e-commerce development role because of my experience on the other end of the spectrum in terms of operations, international vendor communication, and product development. My new knowledge is full-stack development has given me a lethal combination of skills to help my clients maximize their investments and generate revenue online."
      },
      {
        "company": "Style by JM Footwear",
        "title": "Founder and Design Director",
        "years": "2019 - Present",
        "description": "As design director, I ensure that all products and experiences are delivered on time, on budget, and to the highest quality standards. In addition to communicating SBJM's creative vision to the design team, and partners, I supervise the entire design process and all-important technical decisions that encompass the design and distribution process."
      },
      {
        "company": "The Royal Guard - Style Agency",
        "title": "Founder and Master Stylist",
        "years": "2019 - Present",
        "description": "As a private wardrobe liaison, I create custom looks that fit my client's personal and professional lifestyle. My business books consist of high-profile individuals, entrepreneurs, executives, doctors, attorneys, and real estate professionals. TRG is a membership-based service where a current active member must recommend applicants."
      },
      {
        "company": "Werkplaats - Elite Business Suites",
        "title": "Director of Business Development",
        "years": "2013 - 2017",
        "description": "As a business development director, I also lead sales and client-relationship management, tracked new markets and emerging trends, recommends new products and services to the business center clients, proposed and developed new strategic partnerships, wrote proposals and plans, and guided long-term objectives to meet business needs and requirements."
      }
    ],
    "skills": [
      {
        "name": "Full Stack Web Development",
        "level": "89%"
      },
      {
        "name": "Product Design + Development",
        "level": "95%"
      },
      {
        "name": "Business Development",
        "level": "98%"
      },
      {
        "name": "High Volume Sales",
        "level": "96%"
      },
      {
        "name": "Customer Retention + Facing",
        "level": "94%"
      },
      {
        "name": "Leadership",
        "level": "90%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Runnit Live",
        "category": "Hybrid",
        "image": "runnit.jpg",
        "url": "https://runnit.live"
      },
      {
        "title": "Athlete Talk",
        "category": "Hybrid",
        "image": "athletetalk.jpg",
        "url": "https://wakeforest.yourathletestalk.com/"
      },
      {
        "title": "SBJM Footwear",
        "category": "Hybrid",
        "image": "sbjm.jpg",
        "url": "https://stylebyjm.com"
      },
      {
        "title": "The Royal Guard Style Agency",
        "category": "Hybrid",
        "image": "trg.jpg",
        "url": "https://theroyalguard.club/login"
      },
      {
        "title": "DSTRKT.TV",
        "category": "Mobile",
        "image": "dstrkttv.jpg",
        "url": "https://expo.io/@stylebyjmsa/projects/dstrkttv"
      },
      {
        "title": "Stuido-139 ",
        "category": "Mobile",
        "image": "studio139.jpg",
        "url": "https://expo.io/@stylebyjmsa/projects/s139mobile"
      },
      {
        "title": "Circulate.io",
        "category": "Hybrid",
        "image": "studio139.jpg",
        "url": "https://www.circulateapp.io"
      
      },
      {
        "title": "Smouthered",
        "category": "Hybrid",
        "image": "studio139.jpg",
        "url": "https://www.smoutheredsa.com"
      
      },
      {
        "title": "Shorty Stacks",
        "category": "Hybrid",
        "image": "studio139.jpg",
        "url": "https://www.shortystackssa.com"
      }
     
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Perfection. JM's CRM solution for our business was game changer. It was worth the wait and expense.",
        "user": "RS, CEO/Founder"
      },
      
       {"text": "I worked with JM a few years ago on a project and he was such a delight to work with. He is extremely knowledgeable in his trade and has a true passion for his work. ",
        "user": "DFM, Founder/General Partner"}
      
    ]
  }
}
